init.org
#+Title: Emacs Config
#+Author: jlindsey
#+Description: My init.el
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes :comments no
#+Startup: showeverything
#+Options: toc:3

#+begin_src emacs-lisp
    ;;; init.el -- tangled from init.org -*- lexical-binding: t -*-
#+end_src

*  Contents :toc_3:
- [[#intro][Intro]]
- [[#core-setup][Core Setup]]
  - [[#auto-tangle-hook][Auto-tangle Hook]]
  - [[#package-manager][Package manager]]
    - [[#repos][Repos]]
    - [[#straight][Straight]]
    - [[#helpers][Helpers]]
  - [[#emacs-defaults][Emacs Defaults]]
  - [[#savehist][Savehist]]
  - [[#evil-][Evil 😈]]
- [[#keybinds][Keybinds]]
- [[#org][Org]]
- [[#ui][UI]]
  - [[#theme][Theme]]
  - [[#modeline][Modeline]]
  - [[#nerd-icons][Nerd Icons]]
  - [[#dashboard][Dashboard]]
  - [[#popup-management][Popup Management]]
    - [[#shackle][Shackle]]
    - [[#popper][Popper]]
    - [[#solaire][Solaire]]
  - [[#misc][Misc]]
    - [[#macos][MacOS]]
- [[#help][Help]]
  - [[#helpful][Helpful]]
  - [[#flycheck][Flycheck]]
  - [[#which-key][Which-key]]
- [[#project-management][Project Management]]
  - [[#treemacs][Treemacs]]
- [[#completion][Completion]]
  - [[#corfu][Corfu]]
  - [[#cape][Cape]]
  - [[#vertico][Vertico]]
    - [[#marginalia][Marginalia]]
  - [[#yasnippet][Yasnippet]]
  - [[#consult][Consult]]
  - [[#orderless][Orderless]]
- [[#lsp][LSP]]
- [[#treesitter][Treesitter]]
- [[#languages][Languages]]
  - [[#markdown][Markdown]]
  - [[#elisp][Elisp]]
  - [[#go][Go]]
  - [[#python][Python]]
  - [[#yaml][YAML]]
    - [[#ansible][Ansible]]
- [[#misc-1][Misc]]
- [[#performance-and-finalize][Performance and Finalize]]

* Intro
This config is written in Org Babel with a literate style to make it easier to navigate and annotate. The "real" init is
therefore in ~init.org~ and you should avoid editing the derived ~init.el~ directly. A hook is provided to automatically
tangle the code blocks into ~init.el~ on save. If you need (for example on an error that prevents the hook) you can
manually tangle with ~C-c C-v t~.

At a high level: I use ~evil-mode~ exclusively, and prefer a non-chorded interaction style a la Doom and
Spacemacs. IDE-like features are mainly drawn from LSP mode, with Corfu/Vertico/Cape used for autocomplete.

Much inspiration taken from:
+ https://github.com/MiniApollo/kickstart.emacs
+ https://github.com/doomemacs/doomemacs
+ https://www.spacemacs.org/ 

* Core Setup
Make startup faster by reducing the frequency of garbage collection. This will be set back when startup finishes.
#+begin_src emacs-lisp
    ;; The default is 800 kilobytes. Measured in bytes.
    (setq gc-cons-threshold (* 50 1000 1000))
#+end_src

Update load path for personal libraries etc. We're not doing any ~autoload~ magic here at the moment.
#+begin_src emacs-lisp
    (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
    (require 'project-indicators)
#+end_src

** Auto-tangle Hook
#+begin_src emacs-lisp
    (defun start/org-babel-tangle-config ()
      "Automatically tangle our init.org config file"
      (interactive)
      (when (string-equal (file-name-directory (buffer-file-name))
                          (expand-file-name user-emacs-directory))
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'start/org-babel-tangle-config)))
#+end_src

** Package manager
I use ~straight.el~ as the package manager.

*** Repos
Set repo lists

#+begin_src emacs-lisp
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                             ("org" . "https://orgmode.org/elpa/")
                             ("elpa" . "https://elpa.gnu.org/packages/")
                             ("nongnu" . "https://elpa.nongnu.org/nongnu/")))
#+end_src

*** Straight
I use ~straight.el~ instead of ~package.el~ for the ability to do rollbacks and easily use Github et al sources instead
of just the repos. It's set up to use normal ~use-package~ forms; the one difference to remember is that if you don't
want a given package installed (that is: you want to use ~use-package~ as a way to ~require~ built-in packages like Org
with the ability to also set hooks etc) then ~:ensure nil~ must be used with ~:straight nil~.

In ~early-init.el~ we set ~package-enable-at-startup nil~. It is the only thing in that file. We also set that variable
here, mainly in order to make it easier to run Emacs in batch mode to update / freeze / thaw the packages in a script.

#+begin_src emacs-lisp
    (setq package-enable-at-startup nil ;; also set in early-init.el
          straight-use-package-version 'straight
          straight-use-package-by-default t)

    (defvar bootstrap-version)

    (let ((bootstrap-file
           (expand-file-name
            "straight/repos/straight.el/bootstrap.el"
            (or (bound-and-true-p straight-base-dir)
                user-emacs-directory)))
          (bootstrap-version 7))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
    		(url-retrieve-synchronously
             "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
#+end_src


*** Helpers
Define a couple helpers here to manage Straight. Bound later on.

#+begin_src emacs-lisp
    (defun straight/cleanup ()
      "Prunes cache and build dirs, and purges unused repos"
      (interactive)
      (straight-prune-build)
      (straight-remove-unused-repos t))

    (defun straight/update ()
      "Pulls and updates all packages"
      (interactive)
      (straight-pull-recipe-repositories)
      (straight-pull-all))
#+end_src

** Emacs Defaults
Configure baseline Emacs defaults.

#+begin_src emacs-lisp
    (use-package emacs
      :custom
    	;; Enable these for Vertico
      (context-menu-mode t)
      (enable-recursive-minibuffers t)

    	;; Turn off all the window chrome
      (menu-bar-mode nil)
      (scroll-bar-mode nil)
      (tool-bar-mode nil)

      (delete-selection-mode t)
      (electric-indent-mode t)
      (electric-pair-mode nil)

      (blink-cursor-mode nil)
      (global-auto-revert-mode t)

      (fill-column 120) ;; Using evil's Vgq to format paragraphs, wrap on col 120
      (tab-width 4)
      (line-spacing 0.12)

      (make-backup-files nil) ;; Do not make ~ files
      (auto-save-default nil) ;; Do not make # files

      ;; Hide commands in M-x which do not work in the current mode.
      (read-extended-command-predicate #'command-completion-default-include-p)
      ;; Do not allow the cursor in the minibuffer prompt
      (minibuffer-prompt-properties '(readonly t cursor-intangible t face minibuffer-prompt))

      :config
      (set-face-attribute
       'default nil
       :family "Hack"
       :height 125
       :weight 'medium)

      :hook
      ; hide minor modes
      (prog-mode . (lambda () (hs-minor-mode t)))
      
      ; enable line numbers but not globally
      (prog-mode . display-line-numbers-mode)
      (text-mode . display-line-numbers-mode)
      (conf-mode . display-line-numbers-mode)

      :bind
      (([escape] . keyboard-escape-quit)))
    #+end_src

** Savehist
Persists various selection and file histories to a file, to be restored on startup. Core Emacs built-in, but must be
used and enabled. By default, saves to ~$HOME/.config/emacs/history~.

#+begin_src emacs-lisp
    (use-package savehist
      :ensure nil
      :init (savehist-mode))
#+end_src

** Evil 😈
Setup Evil mode and associated plugins.

#+begin_src emacs-lisp
    (use-package evil
      :init
      (evil-mode)
      :custom
      (evil-want-keybinding nil)
      (evil-want-C-u-scroll t)
      (evil-want-C-i-jump nil)
      (evil-undo-system 'undo-redo)
      (evil-visual-update-x-selection-p nil)
      :config
      (add-hook 'after-change-major-mode-hook (lambda () (setq-local evil-shift-width tab-width))))
#+end_src

Include ~evil-collection~, which is a set of keymaps and bindings for special buffer types like ~help-mode~ and
~dired~. I set it up as an explicit whitelist rather than letting it default to trying to remap everything it knows
about. Note that this means you need to update this list whenever a package is added with a new mode.
#+begin_src emacs-lisp
    (use-package evil-collection
      :after evil
      :config
      (setq evil-collection-mode-list '(dired ibuffer magit corfu vertico consult info
    										  help helpful compilation flycheck))
      (evil-collection-init))
#+end_src

~evil-surround~ is a port of tpope's ~vim-surround~ which provides mappings to easily surround a text object with pairs of quotes, parens, brackets, etc.
#+begin_src emacs-lisp
    (use-package evil-surround
      :after evil
      :config (global-evil-surround-mode 1))
#+end_src

~evil-lion~ ports ~vim-lion~, for easy line alignment motions.
#+begin_src emacs-lisp
    (use-package evil-lion
      :after evil
      :config (evil-lion-mode))
#+end_src

~evil-escape~ universalizes escaping in all types of buffers. I bind it to ~C-g~ as a global "cancel".
#+begin_src emacs-lisp
    (use-package evil-escape
      :after evil
      :custom
      (evil-escape-excluded-states '(normal visual multiedit emacs motion))
      (evil-escape-excluded-major-modes '(treemacs-mode))
      (evil-escape-key-sequence nil)
      (evil-escape-delay 0.15)
      :init
      (evil-escape-mode)
      (evil-define-key* '(insert replace visual operator) 'global "\C-g" #'evil-escape)
      :config
      ;; `evil-escape' in the minibuffer is more disruptive than helpful. That is,
      ;; unless we have `evil-collection-setup-minibuffer' enabled, in which case we
      ;; want the same behavior in insert mode as we do in normal buffers.
      (add-hook 'evil-escape-inhibit-functions
    			(defun my/evil-inhibit-escape-in-minibuffer-fn ()
    			  (and (minibufferp)
    				   (or (not (bound-and-true-p evil-collection-setup-minibuffer))
    					   (evil-normal-state-p))))))
#+end_src

