init.el
;;; init.el -- tangled from init.org -*- lexical-binding: t -*-

;; The default is 800 kilobytes. Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
(require 'project-indicators)

(defun start/org-babel-tangle-config ()
  "Automatically tangle our init.org config file"
  (interactive)
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'start/org-babel-tangle-config)))

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(setq package-enable-at-startup nil ;; also set in early-init.el
      straight-use-package-version 'straight
      straight-use-package-by-default t)

(defvar bootstrap-version)

(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
		(url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(defun straight/cleanup ()
  "Prunes cache and build dirs, and purges unused repos"
  (interactive)
  (straight-prune-build)
  (straight-remove-unused-repos t))

(defun straight/update ()
  "Pulls and updates all packages"
  (interactive)
  (straight-pull-recipe-repositories)
  (straight-pull-all))

(use-package emacs
  :custom
	;; Enable these for Vertico
  (context-menu-mode t)
  (enable-recursive-minibuffers t)

	;; Turn off all the window chrome
  (menu-bar-mode nil)
  (scroll-bar-mode nil)
  (tool-bar-mode nil)

  (delete-selection-mode t)
  (electric-indent-mode t)
  (electric-pair-mode nil)

  (blink-cursor-mode nil)
  (global-auto-revert-mode t)

  (fill-column 120) ;; Using evil's Vgq to format paragraphs, wrap on col 120
  (tab-width 4)
  (line-spacing 0.12)

  (make-backup-files nil) ;; Do not make ~ files
  (auto-save-default nil) ;; Do not make # files

  ;; Hide commands in M-x which do not work in the current mode.
  (read-extended-command-predicate #'command-completion-default-include-p)
  ;; Do not allow the cursor in the minibuffer prompt
  (minibuffer-prompt-properties '(readonly t cursor-intangible t face minibuffer-prompt))

  :config
  (set-face-attribute
   'default nil
   :family "Hack"
   :height 125
   :weight 'medium)

  :hook
  ; hide minor modes
  (prog-mode . (lambda () (hs-minor-mode t)))
  
  ; enable line numbers but not globally
  (prog-mode . display-line-numbers-mode)
  (text-mode . display-line-numbers-mode)
  (conf-mode . display-line-numbers-mode)

  :bind
  (([escape] . keyboard-escape-quit)))

(use-package savehist
  :ensure nil
  :init (savehist-mode))

(use-package evil
  :init
  (evil-mode)
  :custom
  (evil-want-keybinding nil)
  (evil-want-C-u-scroll t)
  (evil-want-C-i-jump nil)
  (evil-undo-system 'undo-redo)
  (evil-visual-update-x-selection-p nil)
  :config
  (add-hook 'after-change-major-mode-hook (lambda () (setq-local evil-shift-width tab-width))))

(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dired ibuffer magit corfu vertico consult info
										  help helpful compilation flycheck))
  (evil-collection-init))

(use-package evil-surround
  :after evil
  :config (global-evil-surround-mode 1))

(use-package evil-lion
  :after evil
  :config (evil-lion-mode))

(use-package evil-escape
  :after evil
  :custom
  (evil-escape-excluded-states '(normal visual multiedit emacs motion))
  (evil-escape-excluded-major-modes '(treemacs-mode))
  (evil-escape-key-sequence nil)
  (evil-escape-delay 0.15)
  :init
  (evil-escape-mode)
  (evil-define-key* '(insert replace visual operator) 'global "\C-g" #'evil-escape)
  :config
  ;; `evil-escape' in the minibuffer is more disruptive than helpful. That is,
  ;; unless we have `evil-collection-setup-minibuffer' enabled, in which case we
  ;; want the same behavior in insert mode as we do in normal buffers.
  (add-hook 'evil-escape-inhibit-functions
			(defun my/evil-inhibit-escape-in-minibuffer-fn ()
			  (and (minibufferp)
				   (or (not (bound-and-true-p evil-collection-setup-minibuffer))
					   (evil-normal-state-p))))))
