init.org
* Keybinds
This config uses ~general~ for keybind management because:
+ I prefer the doom/spacemacs single leader key style, and it makes this easy to set up
+ It supports using ~use-package~ to set up keys at the point where they are most relevent
          
Given that second point, only keys which aren't associated with a particular package should be set here. Things like
window split management and movement, quitting/restarting, etc. Top-level "categories" are also set, although they may
be empty here and added to later on. Package-specific bindings should use the ~:general~ form in ~use-package~.

#+begin_src emacs-lisp
    (use-package general
      :custom
      (general-use-package-emit-autoloads t)
      :config
      (general-evil-setup)
      
      (general-define-key
       :states '(visual)
       "s-/" 'comment-or-uncomment-region)

      (general-define-key
       :states '(normal)
       "s-/" 'comment-line)

      (general-define-key
       :states '(normal)
       "g t" 'tab-line-switch-to-next-tab
       "g T" 'tab-line-switch-to-prev-tab)

      (general-create-definer start/leader-keys
    	:states '(normal emacs)
    	:keymaps 'override
    	:prefix "SPC"
    	:global-prefix "SPC")
      
      (start/leader-keys
    	"SPC" '(find-file :wk "Find file")
    	":" '(execute-extended-command :wk "M-x")
    	"TAB" '(treemacs-select-window :wk "Treemacs"))

      (start/leader-keys
    	"~" '(:ignore t :wk "Straight")
    	"~ c" '(straight/cleanup :wk "Cleanup")
    	"~ u" '(straight/update :wk "Update")
    	"~ f" 'straight-freeze-versions
    	"~ t" `straight-thaw-versions)
      
      (start/leader-keys
    	"b" '(:ignore t :wk "Buffers")
    	"b i" '(ibuffer :wk "ibuffer")
    	"b d" '(evil-delete-buffer :wk "Delete buffer"))
      
      (start/leader-keys
    	"C" '(:ignore t :wk "Configs")
    	"C i" '((lambda () (interactive) (find-file "~/.config/emacs/init.org")) :wk "Edit init.org")
    	"C e" '((lambda () (interactive) (find-file "~/.config/emacs/early-init.el")) :wk "Edit early-init.el")
    	"C r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "Reload init.el"))

      (start/leader-keys
    	"l" '(:ignore t :wk "LSP"))

      (start/leader-keys
    	"q" '(:ignore t :wk "Quit")
    	"q r" '(restart-emacs :wk "Restart")
    	"q q" '(evil-quit-all :wk "Quit All"))

      (start/leader-keys
    	"t" '(:ignore t :wk "Toggles")
    	"t f" 'toggle-frame-fullscreen
    	"t t" 'tab-line-mode)
      
      (start/leader-keys
    	"w" '(:ignore t :wk "Windows / Splits")
    	"w s" 'evil-window-split
    	"w v" 'evil-window-vsplit
    	"w S" 'evil-window-new
    	"w V" 'evil-window-vnew
    	"w h" 'evil-window-left
    	"w j" 'evil-window-down
    	"w k" 'evil-window-up
    	"w l" 'evil-window-right
    	"w H" 'evil-window-move-far-left
    	"w J" 'evil-window-move-very-bottom
    	"w K" 'evil-window-move-very-top
    	"w L" 'evil-window-move-far-right)
      )
#+end_src

* Org
I don't use Org mode much except for this config, so just set up a couple simple packages and configs here.

#+begin_src emacs-lisp
    (use-package org
      :ensure nil
      :straight nil
      :custom
      (org-edit-src-content-indentation 4)
      (org-return-follows-link t)
      :hook
      ((org-mode . org-indent-mode)
       (org-mode . my/set-literate-init-capfs))
      :init
      (defun my/set-literate-init-capfs ()
    	(setq-local completion-at-point-functions
    				(list #'cape-elisp-block #'cape-file #'cape-keyword #'cape-dabbrev))))
#+end_src

Automatically manage the table of contents at the beginning of this file based on headings:
#+begin_src emacs-lisp
    (use-package toc-org
      :commands toc-org-enable
      :hook (org-mode . toc-org-mode))
#+end_src

A built-in Emacs Org package that provides org-mode templates. For our purposes here, it lets you type ~<s TAB~ to make
a source code block.
#+begin_src emacs-lisp
    (use-package org-tempo
      :ensure nil
      :straight nil
      :after org)
#+end_src

Make it look a bit prettier:
#+begin_src emacs-lisp
    (use-package org-superstar
      :after org
      :hook (org-mode . org-superstar-mode))
#+end_src


* UI
Various UI customizations like theme, modeline, etc

** Theme
Use ~doom-themes~, which is a theme collection package. Nice to be able to switch sometimes.

#+begin_src emacs-lisp
    (use-package doom-themes
      :custom
      (doom-themes-enable-bold t)
      (doom-themes-enable-italic t)
      (doom-themes-treemacs-theme "doom-colors")
      :config
      (load-theme 'doom-material t)
      (doom-themes-visual-bell-config)
      (doom-themes-treemacs-config))
#+end_src

** Modeline
Use ~doom-modeline~ instead of the default, which is minimal enough while still having lots of functionality and interop
with other packages like Flycheck and LSP.

#+begin_src emacs-lisp
    (use-package doom-modeline
      :custom
      (doom-modeline-height 25)
      (doom-modeline-total-line-number t)
      (doom-modeline-project-name t)
      :hook (after-init . doom-modeline-mode))
#+end_src

** Nerd Icons
Use Nerd Icons everywhere we can. Here is where we put the base ~nerd-icons~ package as well as the integrations with
core modes like Dired and Ibuffer. Integrations with other packages like Treemacs and Corfu are in those sections.

#+begin_src emacs-lisp
    (use-package nerd-icons
      :if (display-graphic-p))

    (use-package nerd-icons-dired
      :hook (dired-mode . (lambda () (nerd-icons-dired-mode t))))

    (use-package nerd-icons-ibuffer
      :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

** Dashboard
A nice startup screen showing recent files, projects, etc.

#+begin_src emacs-lisp
    (use-package dashboard
      :custom
      (dashboard-startup-banner 'logo)
      (dashboard-projects-backed 'project-el)
      (dashboard-center-content t)
      (dashboard-vertically-center-content t)
      (dashboard-navigation-cycle t)
      (dashboard-display-icons t)
      (dashboard-icon-type 'nerd-icons)
      (dashboard-set-heading-icons t)
      (dashboard-set-file-icons t)
      :init
      (setq dashboard-items '((recents . 10)
    						  (projects . 5)))
      :config (dashboard-setup-startup-hook))
#+end_src

Required for the section dividers:
#+begin_src emacs-lisp
    (use-package page-break-lines
      :init (page-break-lines-mode))
#+end_src

** Popup Management
Emacs makes lots of different windows and buffer types that are essentially ephemeral: ~helpful-mode~, Flycheck,
Warnings, Messages, etc. The packages and configs here help to manage them in a less annoying way.

*** Shackle
Set rules for how these kinds of windows are displayed: size, position alignment, whether they steal focus, etc.

#+begin_src emacs-lisp
    (use-package shackle
      :config
      (setq shackle-rules
            '(
              (("\\*Help\\*" helpful-mode) :align right :size 0.35 :select nil)
    		  (lsp-help-mode :align right :size 0.35 :select nil)

    		  ("\\*compilation\\*" :align below :size 0.25 :noselect t)
    		  (("\\*Flycheck errors\\*" flycheck-error-list-mode) :align below :size 0.25 :select t)
    		  (("\\*Warnings\\*" special-mode) :align below :size 0.2 :select nil)

    		  ("\\*Messages\\*" :align below :size 0.3 :select nil)
    		  ("\\*Backtrace\\*" :align below :size 0.3 :select t))
    		)
      (shackle-mode 1))
#+end_src

*** Popper
Manager for "popup" windows. Matching window names or buffer modes are treated as inferior, easily dismissable, and
toggleable. You can cycle through these kinds of windows, list them all, group them by project, etc.

#+begin_src emacs-lisp
    (use-package popper
      :custom
      (popper-display-control nil)
      (popper-group-function #'popper-group-by-project)
      (popper-mode-line nil)

      :init
      (setq popper-reference-buffers
            '("\\*Messages\\*"
              "\\*Warnings\\*"
    		  "\\*Info\\*"
              "Output\\*$"
              "\\*Async Shell Command\\*"
              "\\*Flycheck errors\\*"
              "\\*helpful.*\\*"
    		  Info-mode
              special-mode
              help-mode
    		  lsp-help-mode
              compilation-mode))

      :config
      (popper-mode +1)
      (popper-echo-mode +1)

      :general
      (start/leader-keys
    	"w q" 'popper-kill-latest-popup
    	"w p" 'popper-toggle
    	"w TAB" 'popper-cycle))
#+end_src

*** Solaire
De-emphasize these kinds of windows by dimming their background.
#+begin_src emacs-lisp
    (use-package solaire-mode
      :hook (after-init . solaire-global-mode))
#+end_src

** Misc
Several minor UI packages that don't need their own TOC heading.

Highlight the current line:
#+begin_src emacs-lisp
    (use-package hl-line
      :ensure nil
      :straight nil
      :hook (after-init . global-hl-line-mode))
#+end_src

*** MacOS
Set a few variables for better experience on Mac
#+begin_src emacs-lisp
    ;; MacOS UI improvements
    (setq
     ns-use-native-fullscreen nil
     mac-redisplay-dont-reset-vscroll t
     mac-mouse-wheel-smooth-scroll nil
     delete-by-moving-to-trash t)

#+end_src

On Mac, make the title bar match the current theme:
#+begin_src emacs-lisp
    (use-package ns-auto-titlebar
      :if (eq system-type 'darwin)
      :init (ns-auto-titlebar-mode +1))
#+end_src



* Help
Several packages for use in getting help or otherwise displaying documentation

** Helpful
Ability to lookup key bindings, Emacs functions, variables, all kinds of things. Along with an enhanced ~help-mode~
buffer UI.

#+begin_src emacs-lisp
    (use-package helpful
      :general
      (start/leader-keys
        "h" '(:ignore t :wk "Help")
        "h h" 'helpful-at-point
        "h c" 'helpful-command
        "h f" 'helpful-callable
        "h k" 'helpful-key
        "h v" 'helpful-variable))
#+end_src

** Flycheck
An alternative to the Emacs-native Flybuild that's a bit more full-featured and has good integration with lsp-mode.

#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode))
#+end_src

