init.org
** Which-key
A built-in package (as of 30) that displays a list of keybindings along the bottom in the minibuffer after a short delay
when you start a chord or leader sequence.

#+begin_src emacs-lisp
    (use-package which-key
      :ensure nil
      :init (which-key-mode 1)
      :custom
      (which-key-side-window-location 'bottom)
      (which-key-sort-order #'which-key-key-order-alpha)
      (which-key-sort-uppercase-first nil)
      (which-key-add-column-padding 1)
      (which-key-min-display-lines 5)
      (which-key-idle-delay 0.5)
      (which-key-max-description-length 35)
      (which-key-allow-imprecise-window-fit nil))
#+end_src


* Project Management
For now, use ~project.el~ for project management, with a few plugins for interop.

#+begin_src emacs-lisp
    (use-package project
      :straight nil
      :ensure nil
      :general
      (start/leader-keys
    	"p" '(:ignore t :wk "Projects")
    	"p p" 'project-switch-project
    	"p f" 'project-find-file))
#+end_src

Separate ibuffer lists into projects.
#+begin_src emacs-lisp
    (use-package ibuffer-project
      :init
      (defun my/ibuffer-project-filter-predicate ()
    	(setq ibuffer-filter-groups (ibuffer-project-generate-filter-groups))
    	(unless (eq ibuffer-sorting-mode 'project-file-relative)
    	  (ibuffer-do-sort-by-project-file-relative)))
      :hook (ibuffer . my/ibuffer-project-filter-predicate))
#+end_src

** Treemacs
Having a top-down filesystem view of your project is handy. We use a couple different plugins for this.

Note that ~project.el~ compatibility is built-in; the ~project-treemacs~ project on MELPA uses Treemacs for project root
definitions and only works while the Treemacs buffer is open; not a great UX.

#+begin_src emacs-lisp
    (use-package treemacs
      :custom
      (treemacs-width 30)
      (treemacs-follow-after-init t)
      (treemacs-sotring 'alphabetic-case-insensitive-asc)
      (treemacs-indent-guide-style 'line)
      (treemacs-is-never-other-window nil)
      :config
      (treemacs-project-follow-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (treemacs-git-mode 'deferred)
      (treemacs-git-commit-diff-mode t)
      (treemacs-indent-guide-mode t))
#+end_src
   
Evil integration plugin
#+begin_src emacs-lisp
    (use-package treemacs-evil
      :after treemacs)
#+end_src

Add icons to the file lists
#+begin_src emacs-lisp
    (use-package treemacs-nerd-icons
      :after treemacs
      :config (treemacs-load-theme 'nerd-icons))
#+end_src

* Completion
Packages for auto-complete and CAPF management. In general I use LSP mode for completions in most cases, but with its
CAPF deferred to Corfu. Vertico is used for minibuffer completion.

There are a lot of different packages managed here and it's not always clear exactly what each thing does: the packages
here are designed to be minimalst and single-purpose. Contrast this with eg Company, which is both a completion backend
and a popup UI element. I've tried to leave good descriptions around each one and describe how they work together.

** Corfu
This is the primary ~completion-at-point~ UI. It calls CAPFs and displays their outputs, allowing you to filter, search,
and select from them. It does not provide any completion backends on its own. For that we use both Cape and LSP.

#+begin_src emacs-lisp
    (use-package corfu
      :init
      (global-corfu-mode)
      (corfu-popupinfo-mode)
      (corfu-history-mode)

      :custom
      (corfu-cycle t)
      (corfu-auto t)
      (corfu-auto-prefix 2)
      (corfu-auto-delay 0.1)
      (corfu-separator ?\s)
      (corfu-popupinfo-delay 0.1)
      (corfu-preselect 'prompt)
      (completion-ignore-case t)
      (text-mode-ispell-word-completion nil)
      (tab-always-indent 'complete)

      :general
      (general-define-key
       :states '(normal insert)
       "C-SPC" 'completion-at-point))
#+end_src

Adds nerd-icons to Corfu based on the type of thing being completed (variable, function, file, etc)
#+begin_src emacs-lisp
    (use-package nerd-icons-corfu
      :after corfu
      :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

** Cape
Completion-at-point extensions library, which provides both a couple useful built-in CAPFs and several functions to
compose and transform other CAPFs. Notably includes the ability to adapt company backends to generic CAPFs that Corfu
can use.

#+begin_src emacs-lisp
    (use-package cape
      :after corfu
      :init
      (add-hook 'completion-at-point-functions #'cape-file)
      (add-hook 'completion-at-point-functions #'cape-keyword)
      :general
      (start/leader-keys
        "a" '(cape-prefix-map :wk "Cape")))
#+end_src

** Vertico
Whereas Corfu handles ~completion-at-point-functions~, Vertico handles ~completing-read~ (in-buffer vs minibuffer
completions). Vertico handles things like listing history and candidates for ~M-x~, searching for files with
~find-file~, etc. Rule of thumb: anything that pops up at the bottom of the screen uses this.

Vertico also interacts with Consult: Vertico is the display, Consult is the backend.

#+begin_src emacs-lisp
    (use-package vertico
      :custom
      (vertico-scroll-margin 5)
      (vertico-count 15)
      (vertico-resize nil)
      (vertico-cycle t)
      :init
      (vertico-mode))
#+end_src

*** Marginalia
Adds help and descriptions to the right of autocomplete suggestions in Vertico:

#+begin_src emacs-lisp
    (use-package marginalia
      :after vertico
      :bind (:map minibuffer-local-map
    			  ("M-A" . marginalia-cycle))
      :init (marginalia-mode))
#+end_src

Also adds nerd-icons to suggestions based on their type:
#+begin_src emacs-lisp
    (use-package nerd-icons-completion
      :after marginalia
      :config (nerd-icons-completion-mode)
      :hook (marginalia-mode . nerd-icons-completion-marginalia-setup))
#+end_src

** Yasnippet
Framework for creating and inserting templated snippets as completions.

#+begin_src emacs-lisp
    (use-package yasnippet
      :after cape
      :config (yas-global-mode 1))
#+end_src

The CAPF functionality is a separate package:

#+begin_src emacs-lisp
    (use-package yasnippet-capf
      :after (cape lsp))
#+end_src

Install the omnibus library of different premade snippets:
#+begin_src emacs-lisp
    (use-package yasnippet-snippets
      :after yasnippet
      :config (yas-reload-all))
#+end_src

** Consult
Provides a series of ~completing-read~ backends; in other words, it is to Vertico what Cape is to Corfu. Also adds
descriptions compatible with Marginalia. It has a lot of different functions for things like looking up buffers, listing
files, finding things (via ~rg~ or ~fd~, or lines within a file, etc). Most of the functions can also be scoped to the
current project.

#+begin_src emacs-lisp
    (use-package consult
      :custom
      (register-preview-delay 0.3)
      (register-preview-function #'consult-register-format)
      (xref-show-xrefs-function #'consult-xref)
      (xref-show-definitions-function #'consult-xref)
      :init
      (advice-add #'register-preview :override #'consult-register-window)
      :hook
      (completion-list-mode . consult-preview-at-point-mode)
      :general
      (start/leader-keys
        "s" '(:ignore t :wk "Search")
        "s b" 'consult-buffer
        "s r" 'consult-recent-file
        "s f" 'consult-fd
        "s g" 'consult-ripgrep
        "s l" 'consult-line
        "s i" 'consult-imenu))
#+end_src

** Orderless
A better way of searching through completion candidates in both modes. The search pattern is divided into
space-separated components, and then candidates are matched against them in any order.

#+begin_src emacs-lisp
    (use-package orderless
      :custom
      (completion-styles '(orderless basic))
      (completion-category-overrides `((file (styles basic partial-completion)))))
#+end_src

* LSP
I used to use Eglot but switched to LSP mode for two specific reasons:
+ I want the ability to run multiple servers per buffer / file type (eg. running both ~pyright~ and ~ruff~ in Python)
+ LSP mode has better integration with several things like Treemacs

LSP mode brings along its own autocomplete UI that will compete with Corfu unless disabled; you also need to write a
small glue function to get them to talk nicely to one another.

Note that ~(lsp-mode)~ isn't called here. I prefer to have the individual languages set their own hooks.

#+begin_src emacs-lisp
    (use-package lsp-mode
      :custom
      (lsp-completion-provider :none)
      (lsp-completion-enable t)
      (lsp-completion-default-behavior :insert)
      :hook
      ((lsp-mode . lsp-enable-which-key-integration)
       (lsp-completion-mode . my/lsp-mode-setup-completion))
      :config
      (defun my/lsp-mode-setup-completion ()
        (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
              '(orderless))
    	(setq-local completion-at-point-functions
    				(list (cape-capf-super #'lsp-completion-at-point #'yasnippet-capf)))))
#+end_src

Also enable the Treemacs integration plugin:

#+begin_src emacs-lisp
    (use-package lsp-treemacs
      :config
      (lsp-treemacs-sync-mode 1)
      :general
      (start/leader-keys
    	"l t s" 'lsp-treemacs-symbols
    	"l t r" 'lsp-treemacs-references
    	"l t i" 'lsp-treemacs-implementations
    	"l t c" 'lsp-treemacs-call-hierarchy
    	"l t t" 'lsp-treemacs-type-hierarchy))
#+end_src

Also enable UI plugin:

#+begin_src emacs-lisp
    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode))
#+end_src

* Treesitter
Use ~tree-sitter~ for better and faster syntax parsing and highlighting. Works well with ~indent-bars-mode~.

#+begin_src emacs-lisp
    (use-package treesit-auto
      :custom
      (treesit-auto-install 'prompt)
      :config
      (treesit-auto-add-to-auto-mode-alist 'all)
      (global-treesit-auto-mode))
#+end_src

NOTE: This package automatically sets ~auto-mode-alist~, remapping major modes to their Treesitter versions (eg
~python-mode~ -> ~python-ts-mode~). For some, like Python, this means you need to use the shared ~python-base-mode~ for
hooks etc. Others don't have this shared base mode and so to avoid breaking hooks you need to shadow the hook
definition. I do this in the base major mode package's ~:init~ section; see Go below for an example.

* Languages
Modes and packages for writing specific languages. I use LSP mode as the primary way of generating completions /
"IntelliSense"-like behavior, and to augment other language-specific packages. Each "main" language package here is
responsible for enabling LSP mode on its own if it wants to.

