init.el

(use-package which-key
  :ensure nil
  :init (which-key-mode 1)
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-min-display-lines 5)
  (which-key-idle-delay 0.5)
  (which-key-max-description-length 35)
  (which-key-allow-imprecise-window-fit nil))

(use-package project
  :straight nil
  :ensure nil
  :general
  (start/leader-keys
	"p" '(:ignore t :wk "Projects")
	"p p" 'project-switch-project
	"p f" 'project-find-file))

(use-package ibuffer-project
  :init
  (defun my/ibuffer-project-filter-predicate ()
	(setq ibuffer-filter-groups (ibuffer-project-generate-filter-groups))
	(unless (eq ibuffer-sorting-mode 'project-file-relative)
	  (ibuffer-do-sort-by-project-file-relative)))
  :hook (ibuffer . my/ibuffer-project-filter-predicate))

(use-package treemacs
  :custom
  (treemacs-width 30)
  (treemacs-follow-after-init t)
  (treemacs-sotring 'alphabetic-case-insensitive-asc)
  (treemacs-indent-guide-style 'line)
  (treemacs-is-never-other-window nil)
  :config
  (treemacs-project-follow-mode t)
  (treemacs-fringe-indicator-mode 'always)
  (treemacs-git-mode 'deferred)
  (treemacs-git-commit-diff-mode t)
  (treemacs-indent-guide-mode t))

(use-package treemacs-evil
  :after treemacs)

(use-package treemacs-nerd-icons
  :after treemacs
  :config (treemacs-load-theme 'nerd-icons))

(use-package corfu
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode)
  (corfu-history-mode)

  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-auto-prefix 2)
  (corfu-auto-delay 0.1)
  (corfu-separator ?\s)
  (corfu-popupinfo-delay 0.1)
  (corfu-preselect 'prompt)
  (completion-ignore-case t)
  (text-mode-ispell-word-completion nil)
  (tab-always-indent 'complete)

  :general
  (general-define-key
   :states '(normal insert)
   "C-SPC" 'completion-at-point))

(use-package nerd-icons-corfu
  :after corfu
  :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package cape
  :after corfu
  :init
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-keyword)
  :general
  (start/leader-keys
    "a" '(cape-prefix-map :wk "Cape")))

(use-package vertico
  :custom
  (vertico-scroll-margin 5)
  (vertico-count 15)
  (vertico-resize nil)
  (vertico-cycle t)
  :init
  (vertico-mode))

(use-package marginalia
  :after vertico
  :bind (:map minibuffer-local-map
			  ("M-A" . marginalia-cycle))
  :init (marginalia-mode))

(use-package nerd-icons-completion
  :after marginalia
  :config (nerd-icons-completion-mode)
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup))

(use-package yasnippet
  :after cape
  :config (yas-global-mode 1))

(use-package yasnippet-capf
  :after (cape lsp))

(use-package yasnippet-snippets
  :after yasnippet
  :config (yas-reload-all))

(use-package consult
  :custom
  (register-preview-delay 0.3)
  (register-preview-function #'consult-register-format)
  (xref-show-xrefs-function #'consult-xref)
  (xref-show-definitions-function #'consult-xref)
  :init
  (advice-add #'register-preview :override #'consult-register-window)
  :hook
  (completion-list-mode . consult-preview-at-point-mode)
  :general
  (start/leader-keys
    "s" '(:ignore t :wk "Search")
    "s b" 'consult-buffer
    "s r" 'consult-recent-file
    "s f" 'consult-fd
    "s g" 'consult-ripgrep
    "s l" 'consult-line
    "s i" 'consult-imenu))

(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides `((file (styles basic partial-completion)))))

(use-package lsp-mode
  :custom
  (lsp-completion-provider :none)
  (lsp-completion-enable t)
  (lsp-completion-default-behavior :insert)
  :hook
  ((lsp-mode . lsp-enable-which-key-integration)
   (lsp-completion-mode . my/lsp-mode-setup-completion))
  :config
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))
	(setq-local completion-at-point-functions
				(list (cape-capf-super #'lsp-completion-at-point #'yasnippet-capf)))))

(use-package lsp-treemacs
  :config
  (lsp-treemacs-sync-mode 1)
  :general
  (start/leader-keys
	"l t s" 'lsp-treemacs-symbols
	"l t r" 'lsp-treemacs-references
	"l t i" 'lsp-treemacs-implementations
	"l t c" 'lsp-treemacs-call-hierarchy
	"l t t" 'lsp-treemacs-type-hierarchy))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))
