init.org
** Markdown
Everybody's favorite README language. Default to Github-flavored markdown mode.

#+begin_src emacs-lisp
    (use-package markdown-mode
      :mode ("/README\\(?:\\.md\\)?\\'" . gfm-mode)
      :custom
      (markdown-italic-underscore t)
      (markdown-gfm-additional-languages '("sh"))
      (markdown-make-gfm-checkboxes-buttons t)
      (markdown-fontify-whole-heading-line t)
      (markdown-fontify-code-blocks-natively t))
#+end_src

** Elisp
Emacs lisp mode hooks

#+begin_src emacs-lisp
    (use-package emacs-lisp-mode
      :straight nil
      :ensure nil
      :hook (emacs-lisp-mode . my/set-elisp-capfs)
      :init
      (defun my/set-elisp-capfs ()
    	(setq-local completion-at-point-functions 
    				(list #'cape-elisp-symbol #'cape-file #'cape-keyword #'cape-dabbrev))))
#+end_src

Highlight quotes in elisp files

#+begin_src emacs-lisp
    (use-package highlight-quoted
      :hook (emacs-lisp-mode . highlight-quoted-mode))
#+end_src

** Go
Program in Go with LSP support from ~gopls~:

#+begin_src emacs-lisp
    (use-package go-mode
      :init (setq go-ts-mode-hook go-mode-hook)
      :mode "\\.go\\'"
      :hook (go-mode . lsp-deferred))
#+end_src

Use ~golangci-lint~ for static checks:

#+begin_notes
12-15-2025: Disable until https://github.com/weijiangan/flycheck-golangci-lint/issues/20 is fixed
#+end_notes

#+begin_src emacs-lisp :tangle no
    (use-package flycheck-golangci-lint
      :hook (go-mode . flycheck-golangci-lint-setup))
#+end_src

** Python
Set up ~python-mode~ hooks and LSP integration (nb. this is setting up the Emacs built-in Python mode, not
~python-mode.el~, which I don't use).

#+begin_src emacs-lisp
    (use-package python
      :ensure nil
      :straight nil
      :hook
      ((python-base-mode . lsp-deferred)
       (python-base-mode . (lambda () (highlight-indentation-mode -1))) ; using indent-bars-mode instead
       (python-base-mode . indent-bars-mode)))
#+end_src

Using elpy for the primary Python mode, alongside LSPs

#+begin_src emacs-lisp
    (use-package elpy
      :hook (python-mode . elpy-enable)
      :general
      (general-create-definer python/mode-leader
    	:states '(normal)
    	:keymaps 'python-base-mode-map
    	:prefix "SPC m")
    	
      (python/mode-leader
    	"i" '(:ignore t :wk "Imports")))
#+end_src

Using "basedpyright" for the primary LSP client for its speed and extra features

#+begin_src emacs-lisp
    (use-package lsp-pyright
      :custom (lsp-pyright-langserver-command "basedpyright"))
#+end_src

Import management:

#+begin_src emacs-lisp
    (use-package pyimport
      :commands (pyimport-remove-unused pyimport-insert-missing)
      :general
      (python/mode-leader
    	"i r" 'pyimport-remove-unused
    	"i m" 'pyimport-insert-missing))

    (use-package py-isort
      :commands (py-isort-region py-isort-buffer)
      :general
      (python/mode-leader
    	"i s" 'py-isort-buffer))
#+end_src

Detect and select the correct Python version / venv:
#+begin_src emacs-lisp
    (use-package pet
      :hook (python-base-mode . pet-mode))
#+end_src

** YAML
Generic YAML file highlighting + LSP support

#+begin_src emacs-lisp
    (use-package yaml-mode
      :init (setq yaml-ts-mode-hook yaml-mode-hook)
      :hook
      ((yaml-mode . lsp-deferred)
       (yaml-mode . indent-bars-mode)))
#+end_src

*** Ansible
Specific packages for Ansible support, uses a custom function to determine whether we're in an Ansible project. Note
that this automatically sets lsp-mode to use ~ansible-ls~ and prompt to install it if missing.

#+begin_src emacs-lisp
    (use-package ansible
      :hook (yaml-mode . (lambda () (when (project/is-ansible-project) (ansible-mode 1)))))
#+end_src

* Misc
Various other minor packages that don't fit in the other sections.

Colorize pairs of delimiters (parens, braces, angles, etc):
#+begin_src emacs-lisp
    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

Automatically trim whitespace from edited lines:
#+begin_src emacs-lisp
    (use-package ws-butler
      :hook (prog-mode . ws-butler-mode))
#+end_src

Automatically format a buffer on save:
#+begin_src emacs-lisp
    (use-package apheleia
      :hook (prog-mode . (lambda () apheleia-global-mode +1))
      :general
      (start/leader-keys
    	"t a" '(apheleia-global-mode :wk "Toggle Apheleia")))
#+end_src

Indentation lines used in several language modes. Note that it isn't enabled here; it should be added to the hooks of
whatever other modes want it.
#+begin_src emacs-lisp
    (use-package indent-bars
      :custom
      (indent-bars-display-on-blank-lines nil)
      (indent-bars-color '(default :face-bg t :blend 0.3))
      (indent-bars-pattern ".")
      (indent-bars-width-frac 0.25)
      (indent-bars-pad-frac 0.1))
#+end_src

Automatically load Direnv into buffer-local config:
#+begin_src emacs-lisp
    (use-package envrc
      :hook (after-init . envrc-global-mode))
#+end_src

* Performance and Finalize
Make GC pauses faster by decreasing the threshold (undoing what we did at the very beginning).
#+begin_src emacs-lisp
    (setq gc-cons-threshold (* 2 1000 1000))
#+end_src

Increase the max amount of data which Emacs reads from the process, leading to slightly less IO churn.
#+begin_src emacs-lisp
    (setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src
