init.el

(use-package markdown-mode
  :mode ("/README\\(?:\\.md\\)?\\'" . gfm-mode)
  :custom
  (markdown-italic-underscore t)
  (markdown-gfm-additional-languages '("sh"))
  (markdown-make-gfm-checkboxes-buttons t)
  (markdown-fontify-whole-heading-line t)
  (markdown-fontify-code-blocks-natively t))

(use-package emacs-lisp-mode
  :straight nil
  :ensure nil
  :hook (emacs-lisp-mode . my/set-elisp-capfs)
  :init
  (defun my/set-elisp-capfs ()
	(setq-local completion-at-point-functions 
				(list #'cape-elisp-symbol #'cape-file #'cape-keyword #'cape-dabbrev))))

(use-package highlight-quoted
  :hook (emacs-lisp-mode . highlight-quoted-mode))

(use-package go-mode
  :init (setq go-ts-mode-hook go-mode-hook)
  :mode "\\.go\\'"
  :hook (go-mode . lsp-deferred))

(use-package python
  :ensure nil
  :straight nil
  :hook
  ((python-base-mode . lsp-deferred)
   (python-base-mode . (lambda () (highlight-indentation-mode -1))) ; using indent-bars-mode instead
   (python-base-mode . indent-bars-mode)))

(use-package elpy
  :hook (python-mode . elpy-enable)
  :general
  (general-create-definer python/mode-leader
	:states '(normal)
	:keymaps 'python-base-mode-map
	:prefix "SPC m")
	
  (python/mode-leader
	"i" '(:ignore t :wk "Imports")))

(use-package lsp-pyright
  :custom (lsp-pyright-langserver-command "basedpyright"))

(use-package pyimport
  :commands (pyimport-remove-unused pyimport-insert-missing)
  :general
  (python/mode-leader
	"i r" 'pyimport-remove-unused
	"i m" 'pyimport-insert-missing))

(use-package py-isort
  :commands (py-isort-region py-isort-buffer)
  :general
  (python/mode-leader
	"i s" 'py-isort-buffer))

(use-package pet
  :hook (python-base-mode . pet-mode))

(use-package yaml-mode
  :init (setq yaml-ts-mode-hook yaml-mode-hook)
  :hook
  ((yaml-mode . lsp-deferred)
   (yaml-mode . indent-bars-mode)))

(use-package ansible
  :hook (yaml-mode . (lambda () (when (project/is-ansible-project) (ansible-mode 1)))))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package ws-butler
  :hook (prog-mode . ws-butler-mode))

(use-package apheleia
  :hook (prog-mode . (lambda () apheleia-global-mode +1))
  :general
  (start/leader-keys
	"t a" '(apheleia-global-mode :wk "Toggle Apheleia")))

(use-package indent-bars
  :custom
  (indent-bars-display-on-blank-lines nil)
  (indent-bars-color '(default :face-bg t :blend 0.3))
  (indent-bars-pattern ".")
  (indent-bars-width-frac 0.25)
  (indent-bars-pad-frac 0.1))

(use-package envrc
  :hook (after-init . envrc-global-mode))

(setq gc-cons-threshold (* 2 1000 1000))

(setq read-process-output-max (* 1024 1024)) ;; 1mb
